zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cz_ca/pic32cz_ca70/include/pio/pic32cz2051ca70064.h
/*
 * Peripheral I/O description for pic32cz2051ca70064
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-04-15T17:34:59Z  */
#ifndef _pic32cz2051ca70064_GPIO_H_
#define _pic32cz2051ca70064_GPIO_H_

/* ======================= Peripheral I/O pin numbers ======================= */
#define PIN_PA03                    (    3)  /* Pin Number for PA03 */
#define PIN_PA04                    (    4)  /* Pin Number for PA04 */
#define PIN_PA05                    (    5)  /* Pin Number for PA05 */
#define PIN_PA07                    (    7)  /* Pin Number for PA07 */
#define PIN_PA08                    (    8)  /* Pin Number for PA08 */
#define PIN_PA09                    (    9)  /* Pin Number for PA09 */
#define PIN_PA10                    (   10)  /* Pin Number for PA10 */
#define PIN_PA11                    (   11)  /* Pin Number for PA11 */
#define PIN_PA12                    (   12)  /* Pin Number for PA12 */
#define PIN_PA13                    (   13)  /* Pin Number for PA13 */
#define PIN_PA14                    (   14)  /* Pin Number for PA14 */
#define PIN_PA21                    (   21)  /* Pin Number for PA21 */
#define PIN_PA22                    (   22)  /* Pin Number for PA22 */
#define PIN_PA24                    (   24)  /* Pin Number for PA24 */
#define PIN_PA27                    (   27)  /* Pin Number for PA27 */
#define PIN_PB00                    (   32)  /* Pin Number for PB00 */
#define PIN_PB01                    (   33)  /* Pin Number for PB01 */
#define PIN_PB02                    (   34)  /* Pin Number for PB02 */
#define PIN_PB03                    (   35)  /* Pin Number for PB03 */
#define PIN_PB04                    (   36)  /* Pin Number for PB04 */
#define PIN_PB05                    (   37)  /* Pin Number for PB05 */
#define PIN_PB06                    (   38)  /* Pin Number for PB06 */
#define PIN_PB07                    (   39)  /* Pin Number for PB07 */
#define PIN_PB08                    (   40)  /* Pin Number for PB08 */
#define PIN_PB09                    (   41)  /* Pin Number for PB09 */
#define PIN_PB12                    (   44)  /* Pin Number for PB12 */
#define PIN_PD00                    (   96)  /* Pin Number for PD00 */
#define PIN_PD01                    (   97)  /* Pin Number for PD01 */
#define PIN_PD02                    (   98)  /* Pin Number for PD02 */
#define PIN_PD03                    (   99)  /* Pin Number for PD03 */
#define PIN_PD04                    (  100)  /* Pin Number for PD04 */
#define PIN_PD05                    (  101)  /* Pin Number for PD05 */
#define PIN_PD06                    (  102)  /* Pin Number for PD06 */
#define PIN_PD07                    (  103)  /* Pin Number for PD07 */
#define PIN_PD08                    (  104)  /* Pin Number for PD08 */
#define PIN_PD09                    (  105)  /* Pin Number for PD09 */
#define PIN_PD10                    (  106)  /* Pin Number for PD10 */
#define PIN_PD11                    (  107)  /* Pin Number for PD11 */
#define PIN_PD12                    (  108)  /* Pin Number for PD12 */
#define PIN_PD21                    (  117)  /* Pin Number for PD21 */
#define PIN_PD22                    (  118)  /* Pin Number for PD22 */
#define PIN_PD24                    (  120)  /* Pin Number for PD24 */
#define PIN_PD25                    (  121)  /* Pin Number for PD25 */
#define PIN_PD26                    (  122)  /* Pin Number for PD26 */
#define PIN_PD31                    (  127)  /* Pin Number for PD31 */

/* ========================== Peripheral I/O masks ========================== */
#define PIO_PA03                    (_UINT32_(1) << 3) /* PIO mask for PA03 */
#define PIO_PA04                    (_UINT32_(1) << 4) /* PIO mask for PA04 */
#define PIO_PA05                    (_UINT32_(1) << 5) /* PIO mask for PA05 */
#define PIO_PA07                    (_UINT32_(1) << 7) /* PIO mask for PA07 */
#define PIO_PA08                    (_UINT32_(1) << 8) /* PIO mask for PA08 */
#define PIO_PA09                    (_UINT32_(1) << 9) /* PIO mask for PA09 */
#define PIO_PA10                    (_UINT32_(1) << 10) /* PIO mask for PA10 */
#define PIO_PA11                    (_UINT32_(1) << 11) /* PIO mask for PA11 */
#define PIO_PA12                    (_UINT32_(1) << 12) /* PIO mask for PA12 */
#define PIO_PA13                    (_UINT32_(1) << 13) /* PIO mask for PA13 */
#define PIO_PA14                    (_UINT32_(1) << 14) /* PIO mask for PA14 */
#define PIO_PA21                    (_UINT32_(1) << 21) /* PIO mask for PA21 */
#define PIO_PA22                    (_UINT32_(1) << 22) /* PIO mask for PA22 */
#define PIO_PA24                    (_UINT32_(1) << 24) /* PIO mask for PA24 */
#define PIO_PA27                    (_UINT32_(1) << 27) /* PIO mask for PA27 */
#define PIO_PB00                    (_UINT32_(1) << 0) /* PIO mask for PB00 */
#define PIO_PB01                    (_UINT32_(1) << 1) /* PIO mask for PB01 */
#define PIO_PB02                    (_UINT32_(1) << 2) /* PIO mask for PB02 */
#define PIO_PB03                    (_UINT32_(1) << 3) /* PIO mask for PB03 */
#define PIO_PB04                    (_UINT32_(1) << 4) /* PIO mask for PB04 */
#define PIO_PB05                    (_UINT32_(1) << 5) /* PIO mask for PB05 */
#define PIO_PB06                    (_UINT32_(1) << 6) /* PIO mask for PB06 */
#define PIO_PB07                    (_UINT32_(1) << 7) /* PIO mask for PB07 */
#define PIO_PB08                    (_UINT32_(1) << 8) /* PIO mask for PB08 */
#define PIO_PB09                    (_UINT32_(1) << 9) /* PIO mask for PB09 */
#define PIO_PB12                    (_UINT32_(1) << 12) /* PIO mask for PB12 */
#define PIO_PD00                    (_UINT32_(1) << 0) /* PIO mask for PD00 */
#define PIO_PD01                    (_UINT32_(1) << 1) /* PIO mask for PD01 */
#define PIO_PD02                    (_UINT32_(1) << 2) /* PIO mask for PD02 */
#define PIO_PD03                    (_UINT32_(1) << 3) /* PIO mask for PD03 */
#define PIO_PD04                    (_UINT32_(1) << 4) /* PIO mask for PD04 */
#define PIO_PD05                    (_UINT32_(1) << 5) /* PIO mask for PD05 */
#define PIO_PD06                    (_UINT32_(1) << 6) /* PIO mask for PD06 */
#define PIO_PD07                    (_UINT32_(1) << 7) /* PIO mask for PD07 */
#define PIO_PD08                    (_UINT32_(1) << 8) /* PIO mask for PD08 */
#define PIO_PD09                    (_UINT32_(1) << 9) /* PIO mask for PD09 */
#define PIO_PD10                    (_UINT32_(1) << 10) /* PIO mask for PD10 */
#define PIO_PD11                    (_UINT32_(1) << 11) /* PIO mask for PD11 */
#define PIO_PD12                    (_UINT32_(1) << 12) /* PIO mask for PD12 */
#define PIO_PD21                    (_UINT32_(1) << 21) /* PIO mask for PD21 */
#define PIO_PD22                    (_UINT32_(1) << 22) /* PIO mask for PD22 */
#define PIO_PD24                    (_UINT32_(1) << 24) /* PIO mask for PD24 */
#define PIO_PD25                    (_UINT32_(1) << 25) /* PIO mask for PD25 */
#define PIO_PD26                    (_UINT32_(1) << 26) /* PIO mask for PD26 */
#define PIO_PD31                    (_UINT32_(1) << 31) /* PIO mask for PD31 */

/* ================== PIO definition for AFEC0 peripheral =================== */
#define PIN_PA21X1_AFEC0_AD1                       _UINT32_(21)         /* AFEC0 signal: AFEC0_AD1 on PA21 mux X1 */
#define PIO_PA21X1_AFEC0_AD1                       (_UINT32_(1) << 21)  /* AFEC0 signal: AFEC0_AD1 */

#define PIN_PB03X1_AFEC0_AD2                       _UINT32_(35)         /* AFEC0 signal: AFEC0_AD2 on PB03 mux X1 */
#define PIO_PB03X1_AFEC0_AD2                       (_UINT32_(1) << 3)   /* AFEC0 signal: AFEC0_AD2 */

#define PIN_PB02X1_AFEC0_AD5                       _UINT32_(34)         /* AFEC0 signal: AFEC0_AD5 on PB02 mux X1 */
#define PIO_PB02X1_AFEC0_AD5                       (_UINT32_(1) << 2)   /* AFEC0 signal: AFEC0_AD5 */

