zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cz_ca/pic32cz_ca70/include/pio/pic32cz2051ca70064.h
#define PIN_PB00X1_AFEC0_AD10                      _UINT32_(32)         /* AFEC0 signal: AFEC0_AD10 on PB00 mux X1 */
#define PIO_PB00X1_AFEC0_AD10                      (_UINT32_(1) << 0)   /* AFEC0 signal: AFEC0_AD10 */

#define PIN_PA08B_AFEC0_ADTRG                      _UINT32_(8)          /* AFEC0 signal: AFEC0_ADTRG on PA08 mux B */
#define MUX_PA08B_AFEC0_ADTRG                      _UINT32_(1)          /* AFEC0 signal line function value: AFEC0_ADTRG */
#define PIO_PA08B_AFEC0_ADTRG                      (_UINT32_(1) << 8)   /* AFEC0 signal: AFEC0_ADTRG */

/* ================== PIO definition for AFEC1 peripheral =================== */
#define PIN_PB01X1_AFEC1_AD0                       _UINT32_(33)         /* AFEC1 signal: AFEC1_AD0 on PB01 mux X1 */
#define PIO_PB01X1_AFEC1_AD0                       (_UINT32_(1) << 1)   /* AFEC1 signal: AFEC1_AD0 */

#define PIN_PD09C_AFEC1_ADTRG                      _UINT32_(105)        /* AFEC1 signal: AFEC1_ADTRG on PD09 mux C */
#define MUX_PD09C_AFEC1_ADTRG                      _UINT32_(2)          /* AFEC1 signal line function value: AFEC1_ADTRG */
#define PIO_PD09C_AFEC1_ADTRG                      (_UINT32_(1) << 9)   /* AFEC1 signal: AFEC1_ADTRG */

/* =================== PIO definition for DACC peripheral =================== */
#define PIN_PD00X1_DACC_DAC1                       _UINT32_(96)         /* DACC signal: DACC_DAC1 on PD00 mux X1 */
#define PIO_PD00X1_DACC_DAC1                       (_UINT32_(1) << 0)   /* DACC signal: DACC_DAC1 */

/* =================== PIO definition for EFC peripheral ==================== */
#define PIN_PB12X1_EFC_ERASE                       _UINT32_(44)         /* EFC signal: EFC_ERASE on PB12 mux X1 */
#define PIO_PB12X1_EFC_ERASE                       (_UINT32_(1) << 12)  /* EFC signal: EFC_ERASE */

/* =================== PIO definition for GMAC peripheral =================== */
#define PIN_PD10A_GMAC_GCRS                        _UINT32_(106)        /* GMAC signal: GMAC_GCRS on PD10 mux A */
#define MUX_PD10A_GMAC_GCRS                        _UINT32_(0)          /* GMAC signal line function value: GMAC_GCRS */
#define PIO_PD10A_GMAC_GCRS                        (_UINT32_(1) << 10)  /* GMAC signal: GMAC_GCRS */

#define PIN_PD08A_GMAC_GMDC                        _UINT32_(104)        /* GMAC signal: GMAC_GMDC on PD08 mux A */
#define MUX_PD08A_GMAC_GMDC                        _UINT32_(0)          /* GMAC signal line function value: GMAC_GMDC */
#define PIO_PD08A_GMAC_GMDC                        (_UINT32_(1) << 8)   /* GMAC signal: GMAC_GMDC */

#define PIN_PD09A_GMAC_GMDIO                       _UINT32_(105)        /* GMAC signal: GMAC_GMDIO on PD09 mux A */
#define MUX_PD09A_GMAC_GMDIO                       _UINT32_(0)          /* GMAC signal line function value: GMAC_GMDIO */
#define PIO_PD09A_GMAC_GMDIO                       (_UINT32_(1) << 9)   /* GMAC signal: GMAC_GMDIO */

#define PIN_PD05A_GMAC_GRX0                        _UINT32_(101)        /* GMAC signal: GMAC_GRX0 on PD05 mux A */
#define MUX_PD05A_GMAC_GRX0                        _UINT32_(0)          /* GMAC signal line function value: GMAC_GRX0 */
#define PIO_PD05A_GMAC_GRX0                        (_UINT32_(1) << 5)   /* GMAC signal: GMAC_GRX0 */

#define PIN_PD06A_GMAC_GRX1                        _UINT32_(102)        /* GMAC signal: GMAC_GRX1 on PD06 mux A */
#define MUX_PD06A_GMAC_GRX1                        _UINT32_(0)          /* GMAC signal line function value: GMAC_GRX1 */
#define PIO_PD06A_GMAC_GRX1                        (_UINT32_(1) << 6)   /* GMAC signal: GMAC_GRX1 */

#define PIN_PD11A_GMAC_GRX2                        _UINT32_(107)        /* GMAC signal: GMAC_GRX2 on PD11 mux A */
#define MUX_PD11A_GMAC_GRX2                        _UINT32_(0)          /* GMAC signal line function value: GMAC_GRX2 */
#define PIO_PD11A_GMAC_GRX2                        (_UINT32_(1) << 11)  /* GMAC signal: GMAC_GRX2 */

#define PIN_PD12A_GMAC_GRX3                        _UINT32_(108)        /* GMAC signal: GMAC_GRX3 on PD12 mux A */
#define MUX_PD12A_GMAC_GRX3                        _UINT32_(0)          /* GMAC signal line function value: GMAC_GRX3 */
#define PIO_PD12A_GMAC_GRX3                        (_UINT32_(1) << 12)  /* GMAC signal: GMAC_GRX3 */

#define PIN_PD04A_GMAC_GRXDV                       _UINT32_(100)        /* GMAC signal: GMAC_GRXDV on PD04 mux A */
#define MUX_PD04A_GMAC_GRXDV                       _UINT32_(0)          /* GMAC signal line function value: GMAC_GRXDV */
#define PIO_PD04A_GMAC_GRXDV                       (_UINT32_(1) << 4)   /* GMAC signal: GMAC_GRXDV */

#define PIN_PD07A_GMAC_GRXER                       _UINT32_(103)        /* GMAC signal: GMAC_GRXER on PD07 mux A */
#define MUX_PD07A_GMAC_GRXER                       _UINT32_(0)          /* GMAC signal line function value: GMAC_GRXER */
#define PIO_PD07A_GMAC_GRXER                       (_UINT32_(1) << 7)   /* GMAC signal: GMAC_GRXER */

#define PIN_PB01B_GMAC_GTSUCOMP                    _UINT32_(33)         /* GMAC signal: GMAC_GTSUCOMP on PB01 mux B */
#define MUX_PB01B_GMAC_GTSUCOMP                    _UINT32_(1)          /* GMAC signal line function value: GMAC_GTSUCOMP */
#define PIO_PB01B_GMAC_GTSUCOMP                    (_UINT32_(1) << 1)   /* GMAC signal: GMAC_GTSUCOMP */

#define PIN_PB12B_GMAC_GTSUCOMP                    _UINT32_(44)         /* GMAC signal: GMAC_GTSUCOMP on PB12 mux B */
#define MUX_PB12B_GMAC_GTSUCOMP                    _UINT32_(1)          /* GMAC signal line function value: GMAC_GTSUCOMP */
#define PIO_PB12B_GMAC_GTSUCOMP                    (_UINT32_(1) << 12)  /* GMAC signal: GMAC_GTSUCOMP */

#define PIN_PD11C_GMAC_GTSUCOMP                    _UINT32_(107)        /* GMAC signal: GMAC_GTSUCOMP on PD11 mux C */
#define MUX_PD11C_GMAC_GTSUCOMP                    _UINT32_(2)          /* GMAC signal line function value: GMAC_GTSUCOMP */
#define PIO_PD11C_GMAC_GTSUCOMP                    (_UINT32_(1) << 11)  /* GMAC signal: GMAC_GTSUCOMP */

#define PIN_PD02A_GMAC_GTX0                        _UINT32_(98)         /* GMAC signal: GMAC_GTX0 on PD02 mux A */
#define MUX_PD02A_GMAC_GTX0                        _UINT32_(0)          /* GMAC signal line function value: GMAC_GTX0 */
#define PIO_PD02A_GMAC_GTX0                        (_UINT32_(1) << 2)   /* GMAC signal: GMAC_GTX0 */

