zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cz_ca/pic32cz_ca70/include/pio/pic32cz2051ca70064.h
#define PIN_PA14B_PWM0_PWMH3                       _UINT32_(14)         /* PWM0 signal: PWM0_PWMH3 on PA14 mux B */
#define MUX_PA14B_PWM0_PWMH3                       _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWMH3 */
#define PIO_PA14B_PWM0_PWMH3                       (_UINT32_(1) << 14)  /* PWM0 signal: PWM0_PWMH3 */

#define PIN_PB05B_PWM0_PWML0                       _UINT32_(37)         /* PWM0 signal: PWM0_PWML0 on PB05 mux B */
#define MUX_PB05B_PWM0_PWML0                       _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWML0 */
#define PIO_PB05B_PWM0_PWML0                       (_UINT32_(1) << 5)   /* PWM0 signal: PWM0_PWML0 */

#define PIN_PD10B_PWM0_PWML0                       _UINT32_(106)        /* PWM0 signal: PWM0_PWML0 on PD10 mux B */
#define MUX_PD10B_PWM0_PWML0                       _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWML0 */
#define PIO_PD10B_PWM0_PWML0                       (_UINT32_(1) << 10)  /* PWM0 signal: PWM0_PWML0 */

#define PIN_PD24A_PWM0_PWML0                       _UINT32_(120)        /* PWM0 signal: PWM0_PWML0 on PD24 mux A */
#define MUX_PD24A_PWM0_PWML0                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWML0 */
#define PIO_PD24A_PWM0_PWML0                       (_UINT32_(1) << 24)  /* PWM0 signal: PWM0_PWML0 */

#define PIN_PB12A_PWM0_PWML1                       _UINT32_(44)         /* PWM0 signal: PWM0_PWML1 on PB12 mux A */
#define MUX_PB12A_PWM0_PWML1                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWML1 */
#define PIO_PB12A_PWM0_PWML1                       (_UINT32_(1) << 12)  /* PWM0 signal: PWM0_PWML1 */

#define PIN_PD25A_PWM0_PWML1                       _UINT32_(121)        /* PWM0 signal: PWM0_PWML1 on PD25 mux A */
#define MUX_PD25A_PWM0_PWML1                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWML1 */
#define PIO_PD25A_PWM0_PWML1                       (_UINT32_(1) << 25)  /* PWM0 signal: PWM0_PWML1 */

#define PIN_PD26A_PWM0_PWML2                       _UINT32_(122)        /* PWM0 signal: PWM0_PWML2 on PD26 mux A */
#define MUX_PD26A_PWM0_PWML2                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWML2 */
#define PIO_PD26A_PWM0_PWML2                       (_UINT32_(1) << 26)  /* PWM0 signal: PWM0_PWML2 */

/* =================== PIO definition for PWM1 peripheral =================== */
#define PIN_PA21C_PWM1_PWMFI0                      _UINT32_(21)         /* PWM1 signal: PWM1_PWMFI0 on PA21 mux C */
#define MUX_PA21C_PWM1_PWMFI0                      _UINT32_(2)          /* PWM1 signal line function value: PWM1_PWMFI0 */
#define PIO_PA21C_PWM1_PWMFI0                      (_UINT32_(1) << 21)  /* PWM1 signal: PWM1_PWMFI0 */

#define PIN_PA12C_PWM1_PWMH0                       _UINT32_(12)         /* PWM1 signal: PWM1_PWMH0 on PA12 mux C */
#define MUX_PA12C_PWM1_PWMH0                       _UINT32_(2)          /* PWM1 signal line function value: PWM1_PWMH0 */
#define PIO_PA12C_PWM1_PWMH0                       (_UINT32_(1) << 12)  /* PWM1 signal: PWM1_PWMH0 */

#define PIN_PD01B_PWM1_PWMH0                       _UINT32_(97)         /* PWM1 signal: PWM1_PWMH0 on PD01 mux B */
#define MUX_PD01B_PWM1_PWMH0                       _UINT32_(1)          /* PWM1 signal line function value: PWM1_PWMH0 */
#define PIO_PD01B_PWM1_PWMH0                       (_UINT32_(1) << 1)   /* PWM1 signal: PWM1_PWMH0 */

#define PIN_PA14C_PWM1_PWMH1                       _UINT32_(14)         /* PWM1 signal: PWM1_PWMH1 on PA14 mux C */
#define MUX_PA14C_PWM1_PWMH1                       _UINT32_(2)          /* PWM1 signal line function value: PWM1_PWMH1 */
#define PIO_PA14C_PWM1_PWMH1                       (_UINT32_(1) << 14)  /* PWM1 signal: PWM1_PWMH1 */

#define PIN_PD03B_PWM1_PWMH1                       _UINT32_(99)         /* PWM1 signal: PWM1_PWMH1 on PD03 mux B */
#define MUX_PD03B_PWM1_PWMH1                       _UINT32_(1)          /* PWM1 signal line function value: PWM1_PWMH1 */
#define PIO_PD03B_PWM1_PWMH1                       (_UINT32_(1) << 3)   /* PWM1 signal: PWM1_PWMH1 */

#define PIN_PD05B_PWM1_PWMH2                       _UINT32_(101)        /* PWM1 signal: PWM1_PWMH2 on PD05 mux B */
#define MUX_PD05B_PWM1_PWMH2                       _UINT32_(1)          /* PWM1 signal line function value: PWM1_PWMH2 */
#define PIO_PD05B_PWM1_PWMH2                       (_UINT32_(1) << 5)   /* PWM1 signal: PWM1_PWMH2 */

#define PIN_PA08A_PWM1_PWMH3                       _UINT32_(8)          /* PWM1 signal: PWM1_PWMH3 on PA08 mux A */
#define MUX_PA08A_PWM1_PWMH3                       _UINT32_(0)          /* PWM1 signal line function value: PWM1_PWMH3 */
#define PIO_PA08A_PWM1_PWMH3                       (_UINT32_(1) << 8)   /* PWM1 signal: PWM1_PWMH3 */

#define PIN_PD07B_PWM1_PWMH3                       _UINT32_(103)        /* PWM1 signal: PWM1_PWMH3 on PD07 mux B */
#define MUX_PD07B_PWM1_PWMH3                       _UINT32_(1)          /* PWM1 signal line function value: PWM1_PWMH3 */
#define PIO_PD07B_PWM1_PWMH3                       (_UINT32_(1) << 7)   /* PWM1 signal: PWM1_PWMH3 */

#define PIN_PA11C_PWM1_PWML0                       _UINT32_(11)         /* PWM1 signal: PWM1_PWML0 on PA11 mux C */
#define MUX_PA11C_PWM1_PWML0                       _UINT32_(2)          /* PWM1 signal line function value: PWM1_PWML0 */
#define PIO_PA11C_PWM1_PWML0                       (_UINT32_(1) << 11)  /* PWM1 signal: PWM1_PWML0 */

#define PIN_PD00B_PWM1_PWML0                       _UINT32_(96)         /* PWM1 signal: PWM1_PWML0 on PD00 mux B */
#define MUX_PD00B_PWM1_PWML0                       _UINT32_(1)          /* PWM1 signal line function value: PWM1_PWML0 */
#define PIO_PD00B_PWM1_PWML0                       (_UINT32_(1) << 0)   /* PWM1 signal: PWM1_PWML0 */

#define PIN_PA13C_PWM1_PWML1                       _UINT32_(13)         /* PWM1 signal: PWM1_PWML1 on PA13 mux C */
#define MUX_PA13C_PWM1_PWML1                       _UINT32_(2)          /* PWM1 signal line function value: PWM1_PWML1 */
#define PIO_PA13C_PWM1_PWML1                       (_UINT32_(1) << 13)  /* PWM1 signal: PWM1_PWML1 */

