zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cz_ca/pic32cz_ca70/include/pio/pic32cz2051ca70064.h
#define PIN_PD02B_PWM1_PWML1                       _UINT32_(98)         /* PWM1 signal: PWM1_PWML1 on PD02 mux B */
#define MUX_PD02B_PWM1_PWML1                       _UINT32_(1)          /* PWM1 signal line function value: PWM1_PWML1 */
#define PIO_PD02B_PWM1_PWML1                       (_UINT32_(1) << 2)   /* PWM1 signal: PWM1_PWML1 */

#define PIN_PD04B_PWM1_PWML2                       _UINT32_(100)        /* PWM1 signal: PWM1_PWML2 on PD04 mux B */
#define MUX_PD04B_PWM1_PWML2                       _UINT32_(1)          /* PWM1 signal line function value: PWM1_PWML2 */
#define PIO_PD04B_PWM1_PWML2                       (_UINT32_(1) << 4)   /* PWM1 signal: PWM1_PWML2 */

#define PIN_PA05A_PWM1_PWML3                       _UINT32_(5)          /* PWM1 signal: PWM1_PWML3 on PA05 mux A */
#define MUX_PA05A_PWM1_PWML3                       _UINT32_(0)          /* PWM1 signal line function value: PWM1_PWML3 */
#define PIO_PA05A_PWM1_PWML3                       (_UINT32_(1) << 5)   /* PWM1 signal: PWM1_PWML3 */

#define PIN_PD06B_PWM1_PWML3                       _UINT32_(102)        /* PWM1 signal: PWM1_PWML3 on PD06 mux B */
#define MUX_PD06B_PWM1_PWML3                       _UINT32_(1)          /* PWM1 signal line function value: PWM1_PWML3 */
#define PIO_PD06B_PWM1_PWML3                       (_UINT32_(1) << 6)   /* PWM1 signal: PWM1_PWML3 */

/* =================== PIO definition for QSPI peripheral =================== */
#define PIN_PA11A_QSPI_QCS                         _UINT32_(11)         /* QSPI signal: QSPI_QCS on PA11 mux A */
#define MUX_PA11A_QSPI_QCS                         _UINT32_(0)          /* QSPI signal line function value: QSPI_QCS */
#define PIO_PA11A_QSPI_QCS                         (_UINT32_(1) << 11)  /* QSPI signal: QSPI_QCS */

#define PIN_PA13A_QSPI_QIO0                        _UINT32_(13)         /* QSPI signal: QSPI_QIO0 on PA13 mux A */
#define MUX_PA13A_QSPI_QIO0                        _UINT32_(0)          /* QSPI signal line function value: QSPI_QIO0 */
#define PIO_PA13A_QSPI_QIO0                        (_UINT32_(1) << 13)  /* QSPI signal: QSPI_QIO0 */

#define PIN_PA12A_QSPI_QIO1                        _UINT32_(12)         /* QSPI signal: QSPI_QIO1 on PA12 mux A */
#define MUX_PA12A_QSPI_QIO1                        _UINT32_(0)          /* QSPI signal line function value: QSPI_QIO1 */
#define PIO_PA12A_QSPI_QIO1                        (_UINT32_(1) << 12)  /* QSPI signal: QSPI_QIO1 */

#define PIN_PD31A_QSPI_QIO3                        _UINT32_(127)        /* QSPI signal: QSPI_QIO3 on PD31 mux A */
#define MUX_PD31A_QSPI_QIO3                        _UINT32_(0)          /* QSPI signal line function value: QSPI_QIO3 */
#define PIO_PD31A_QSPI_QIO3                        (_UINT32_(1) << 31)  /* QSPI signal: QSPI_QIO3 */

#define PIN_PA14A_QSPI_QSCK                        _UINT32_(14)         /* QSPI signal: QSPI_QSCK on PA14 mux A */
#define MUX_PA14A_QSPI_QSCK                        _UINT32_(0)          /* QSPI signal line function value: QSPI_QSCK */
#define PIO_PA14A_QSPI_QSCK                        (_UINT32_(1) << 14)  /* QSPI signal: QSPI_QSCK */

/* =================== PIO definition for RTC peripheral ==================== */
#define PIN_PB00X1_RTC_RTCOUT0                     _UINT32_(32)         /* RTC signal: RTC_RTCOUT0 on PB00 mux X1 */
#define PIO_PB00X1_RTC_RTCOUT0                     (_UINT32_(1) << 0)   /* RTC signal: RTC_RTCOUT0 */

#define PIN_PB01X1_RTC_RTCOUT1                     _UINT32_(33)         /* RTC signal: RTC_RTCOUT1 on PB01 mux X1 */
#define PIO_PB01X1_RTC_RTCOUT1                     (_UINT32_(1) << 1)   /* RTC signal: RTC_RTCOUT1 */

/* =================== PIO definition for SSC peripheral ==================== */
#define PIN_PA10C_SSC_RD                           _UINT32_(10)         /* SSC signal: SSC_RD on PA10 mux C */
#define MUX_PA10C_SSC_RD                           _UINT32_(2)          /* SSC signal line function value: SSC_RD */
#define PIO_PA10C_SSC_RD                           (_UINT32_(1) << 10)  /* SSC signal: SSC_RD */

#define PIN_PD24B_SSC_RF                           _UINT32_(120)        /* SSC signal: SSC_RF on PD24 mux B */
#define MUX_PD24B_SSC_RF                           _UINT32_(1)          /* SSC signal line function value: SSC_RF */
#define PIO_PD24B_SSC_RF                           (_UINT32_(1) << 24)  /* SSC signal: SSC_RF */

#define PIN_PA22A_SSC_RK                           _UINT32_(22)         /* SSC signal: SSC_RK on PA22 mux A */
#define MUX_PA22A_SSC_RK                           _UINT32_(0)          /* SSC signal line function value: SSC_RK */
#define PIO_PA22A_SSC_RK                           (_UINT32_(1) << 22)  /* SSC signal: SSC_RK */

#define PIN_PB05D_SSC_TD                           _UINT32_(37)         /* SSC signal: SSC_TD on PB05 mux D */
#define MUX_PB05D_SSC_TD                           _UINT32_(3)          /* SSC signal line function value: SSC_TD */
#define PIO_PB05D_SSC_TD                           (_UINT32_(1) << 5)   /* SSC signal: SSC_TD */

#define PIN_PD10C_SSC_TD                           _UINT32_(106)        /* SSC signal: SSC_TD on PD10 mux C */
#define MUX_PD10C_SSC_TD                           _UINT32_(2)          /* SSC signal line function value: SSC_TD */
#define PIO_PD10C_SSC_TD                           (_UINT32_(1) << 10)  /* SSC signal: SSC_TD */

#define PIN_PD26B_SSC_TD                           _UINT32_(122)        /* SSC signal: SSC_TD on PD26 mux B */
#define MUX_PD26B_SSC_TD                           _UINT32_(1)          /* SSC signal line function value: SSC_TD */
#define PIO_PD26B_SSC_TD                           (_UINT32_(1) << 26)  /* SSC signal: SSC_TD */

#define PIN_PB00D_SSC_TF                           _UINT32_(32)         /* SSC signal: SSC_TF on PB00 mux D */
#define MUX_PB00D_SSC_TF                           _UINT32_(3)          /* SSC signal line function value: SSC_TF */
#define PIO_PB00D_SSC_TF                           (_UINT32_(1) << 0)   /* SSC signal: SSC_TF */

#define PIN_PB01D_SSC_TK                           _UINT32_(33)         /* SSC signal: SSC_TK on PB01 mux D */
#define MUX_PB01D_SSC_TK                           _UINT32_(3)          /* SSC signal line function value: SSC_TK */
#define PIO_PB01D_SSC_TK                           (_UINT32_(1) << 1)   /* SSC signal: SSC_TK */

/* =================== PIO definition for SUPC peripheral =================== */
#define PIN_PA04X1_SUPC_WKUP3                      _UINT32_(4)          /* SUPC signal: SUPC_WKUP3 on PA04 mux X1 */
#define PIO_PA04X1_SUPC_WKUP3                      (_UINT32_(1) << 4)   /* SUPC signal: SUPC_WKUP3 */

#define PIN_PA05X1_SUPC_WKUP4                      _UINT32_(5)          /* SUPC signal: SUPC_WKUP4 on PA05 mux X1 */
#define PIO_PA05X1_SUPC_WKUP4                      (_UINT32_(1) << 5)   /* SUPC signal: SUPC_WKUP4 */

