zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cz_ca/pic32cz_ca70/include/pio/pic32cz2051ca70064.h
#define PIN_PA09X1_SUPC_WKUP6                      _UINT32_(9)          /* SUPC signal: SUPC_WKUP6 on PA09 mux X1 */
#define PIO_PA09X1_SUPC_WKUP6                      (_UINT32_(1) << 9)   /* SUPC signal: SUPC_WKUP6 */

#define PIN_PA11X1_SUPC_WKUP7                      _UINT32_(11)         /* SUPC signal: SUPC_WKUP7 on PA11 mux X1 */
#define PIO_PA11X1_SUPC_WKUP7                      (_UINT32_(1) << 11)  /* SUPC signal: SUPC_WKUP7 */

#define PIN_PA14X1_SUPC_WKUP8                      _UINT32_(14)         /* SUPC signal: SUPC_WKUP8 on PA14 mux X1 */
#define PIO_PA14X1_SUPC_WKUP8                      (_UINT32_(1) << 14)  /* SUPC signal: SUPC_WKUP8 */

#define PIN_PB03X1_SUPC_WKUP12                     _UINT32_(35)         /* SUPC signal: SUPC_WKUP12 on PB03 mux X1 */
#define PIO_PB03X1_SUPC_WKUP12                     (_UINT32_(1) << 3)   /* SUPC signal: SUPC_WKUP12 */

#define PIN_PB05X1_SUPC_WKUP13                     _UINT32_(37)         /* SUPC signal: SUPC_WKUP13 on PB05 mux X1 */
#define PIO_PB05X1_SUPC_WKUP13                     (_UINT32_(1) << 5)   /* SUPC signal: SUPC_WKUP13 */

/* =================== PIO definition for TC0 peripheral ==================== */
#define PIN_PA04B_TC0_TCLK0                        _UINT32_(4)          /* TC0 signal: TC0_TCLK0 on PA04 mux B */
#define MUX_PA04B_TC0_TCLK0                        _UINT32_(1)          /* TC0 signal line function value: TC0_TCLK0 */
#define PIO_PA04B_TC0_TCLK0                        (_UINT32_(1) << 4)   /* TC0 signal: TC0_TCLK0 */

#define PIN_PA27B_TC0_TIOB2                        _UINT32_(27)         /* TC0 signal: TC0_TIOB2 on PA27 mux B */
#define MUX_PA27B_TC0_TIOB2                        _UINT32_(1)          /* TC0 signal line function value: TC0_TIOB2 */
#define PIO_PA27B_TC0_TIOB2                        (_UINT32_(1) << 27)  /* TC0 signal: TC0_TIOB2 */

/* =================== PIO definition for TC3 peripheral ==================== */
#define PIN_PD24C_TC3_TCLK11                       _UINT32_(120)        /* TC3 signal: TC3_TCLK11 on PD24 mux C */
#define MUX_PD24C_TC3_TCLK11                       _UINT32_(2)          /* TC3 signal line function value: TC3_TCLK11 */
#define PIO_PD24C_TC3_TCLK11                       (_UINT32_(1) << 24)  /* TC3 signal: TC3_TCLK11 */

#define PIN_PD21C_TC3_TIOA11                       _UINT32_(117)        /* TC3 signal: TC3_TIOA11 on PD21 mux C */
#define MUX_PD21C_TC3_TIOA11                       _UINT32_(2)          /* TC3 signal line function value: TC3_TIOA11 */
#define PIO_PD21C_TC3_TIOA11                       (_UINT32_(1) << 21)  /* TC3 signal: TC3_TIOA11 */

#define PIN_PD22C_TC3_TIOB11                       _UINT32_(118)        /* TC3 signal: TC3_TIOB11 on PD22 mux C */
#define MUX_PD22C_TC3_TIOB11                       _UINT32_(2)          /* TC3 signal line function value: TC3_TIOB11 */
#define PIO_PD22C_TC3_TIOB11                       (_UINT32_(1) << 22)  /* TC3 signal: TC3_TIOB11 */

/* ================== PIO definition for TWIHS0 peripheral ================== */
#define PIN_PA04A_TWIHS0_TWCK0                     _UINT32_(4)          /* TWIHS0 signal: TWIHS0_TWCK0 on PA04 mux A */
#define MUX_PA04A_TWIHS0_TWCK0                     _UINT32_(0)          /* TWIHS0 signal line function value: TWIHS0_TWCK0 */
#define PIO_PA04A_TWIHS0_TWCK0                     (_UINT32_(1) << 4)   /* TWIHS0 signal: TWIHS0_TWCK0 */

#define PIN_PA03A_TWIHS0_TWD0                      _UINT32_(3)          /* TWIHS0 signal: TWIHS0_TWD0 on PA03 mux A */
#define MUX_PA03A_TWIHS0_TWD0                      _UINT32_(0)          /* TWIHS0 signal line function value: TWIHS0_TWD0 */
#define PIO_PA03A_TWIHS0_TWD0                      (_UINT32_(1) << 3)   /* TWIHS0 signal: TWIHS0_TWD0 */

/* ================== PIO definition for TWIHS1 peripheral ================== */
#define PIN_PB05A_TWIHS1_TWCK1                     _UINT32_(37)         /* TWIHS1 signal: TWIHS1_TWCK1 on PB05 mux A */
#define MUX_PB05A_TWIHS1_TWCK1                     _UINT32_(0)          /* TWIHS1 signal line function value: TWIHS1_TWCK1 */
#define PIO_PB05A_TWIHS1_TWCK1                     (_UINT32_(1) << 5)   /* TWIHS1 signal: TWIHS1_TWCK1 */

#define PIN_PB04A_TWIHS1_TWD1                      _UINT32_(36)         /* TWIHS1 signal: TWIHS1_TWD1 on PB04 mux A */
#define MUX_PB04A_TWIHS1_TWD1                      _UINT32_(0)          /* TWIHS1 signal line function value: TWIHS1_TWD1 */
#define PIO_PB04A_TWIHS1_TWD1                      (_UINT32_(1) << 4)   /* TWIHS1 signal: TWIHS1_TWD1 */

/* ================== PIO definition for UART0 peripheral =================== */
#define PIN_PA09A_UART0_URXD0                      _UINT32_(9)          /* UART0 signal: UART0_URXD0 on PA09 mux A */
#define MUX_PA09A_UART0_URXD0                      _UINT32_(0)          /* UART0 signal line function value: UART0_URXD0 */
#define PIO_PA09A_UART0_URXD0                      (_UINT32_(1) << 9)   /* UART0 signal: UART0_URXD0 */

#define PIN_PA10A_UART0_UTXD0                      _UINT32_(10)         /* UART0 signal: UART0_UTXD0 on PA10 mux A */
#define MUX_PA10A_UART0_UTXD0                      _UINT32_(0)          /* UART0 signal line function value: UART0_UTXD0 */
#define PIO_PA10A_UART0_UTXD0                      (_UINT32_(1) << 10)  /* UART0 signal: UART0_UTXD0 */

/* ================== PIO definition for UART1 peripheral =================== */
#define PIN_PA05C_UART1_URXD1                      _UINT32_(5)          /* UART1 signal: UART1_URXD1 on PA05 mux C */
#define MUX_PA05C_UART1_URXD1                      _UINT32_(2)          /* UART1 signal line function value: UART1_URXD1 */
#define PIO_PA05C_UART1_URXD1                      (_UINT32_(1) << 5)   /* UART1 signal: UART1_URXD1 */

#define PIN_PA04C_UART1_UTXD1                      _UINT32_(4)          /* UART1 signal: UART1_UTXD1 on PA04 mux C */
#define MUX_PA04C_UART1_UTXD1                      _UINT32_(2)          /* UART1 signal line function value: UART1_UTXD1 */
#define PIO_PA04C_UART1_UTXD1                      (_UINT32_(1) << 4)   /* UART1 signal: UART1_UTXD1 */

#define PIN_PD26D_UART1_UTXD1                      _UINT32_(122)        /* UART1 signal: UART1_UTXD1 on PD26 mux D */
#define MUX_PD26D_UART1_UTXD1                      _UINT32_(3)          /* UART1 signal line function value: UART1_UTXD1 */
#define PIO_PD26D_UART1_UTXD1                      (_UINT32_(1) << 26)  /* UART1 signal: UART1_UTXD1 */

/* ================== PIO definition for UART2 peripheral =================== */
#define PIN_PD25C_UART2_URXD2                      _UINT32_(121)        /* UART2 signal: UART2_URXD2 on PD25 mux C */
#define MUX_PD25C_UART2_URXD2                      _UINT32_(2)          /* UART2 signal line function value: UART2_URXD2 */
#define PIO_PD25C_UART2_URXD2                      (_UINT32_(1) << 25)  /* UART2 signal: UART2_URXD2 */

#define PIN_PD26C_UART2_UTXD2                      _UINT32_(122)        /* UART2 signal: UART2_UTXD2 on PD26 mux C */
#define MUX_PD26C_UART2_UTXD2                      _UINT32_(2)          /* UART2 signal line function value: UART2_UTXD2 */
#define PIO_PD26C_UART2_UTXD2                      (_UINT32_(1) << 26)  /* UART2 signal: UART2_UTXD2 */

/* ================== PIO definition for USART0 peripheral ================== */
#define PIN_PB02C_USART0_CTS0                      _UINT32_(34)         /* USART0 signal: USART0_CTS0 on PB02 mux C */
#define MUX_PB02C_USART0_CTS0                      _UINT32_(2)          /* USART0 signal line function value: USART0_CTS0 */
#define PIO_PB02C_USART0_CTS0                      (_UINT32_(1) << 2)   /* USART0 signal: USART0_CTS0 */

