zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cz_ca/pic32cz_ca70/include/pio/pic32cz2051ca70064.h
#define PIN_PD00D_USART0_DCD0                      _UINT32_(96)         /* USART0 signal: USART0_DCD0 on PD00 mux D */
#define MUX_PD00D_USART0_DCD0                      _UINT32_(3)          /* USART0 signal line function value: USART0_DCD0 */
#define PIO_PD00D_USART0_DCD0                      (_UINT32_(1) << 0)   /* USART0 signal: USART0_DCD0 */

#define PIN_PD02D_USART0_DSR0                      _UINT32_(98)         /* USART0 signal: USART0_DSR0 on PD02 mux D */
#define MUX_PD02D_USART0_DSR0                      _UINT32_(3)          /* USART0 signal line function value: USART0_DSR0 */
#define PIO_PD02D_USART0_DSR0                      (_UINT32_(1) << 2)   /* USART0 signal: USART0_DSR0 */

#define PIN_PD01D_USART0_DTR0                      _UINT32_(97)         /* USART0 signal: USART0_DTR0 on PD01 mux D */
#define MUX_PD01D_USART0_DTR0                      _UINT32_(3)          /* USART0 signal line function value: USART0_DTR0 */
#define PIO_PD01D_USART0_DTR0                      (_UINT32_(1) << 1)   /* USART0 signal: USART0_DTR0 */

#define PIN_PD03D_USART0_RI0                       _UINT32_(99)         /* USART0 signal: USART0_RI0 on PD03 mux D */
#define MUX_PD03D_USART0_RI0                       _UINT32_(3)          /* USART0 signal line function value: USART0_RI0 */
#define PIO_PD03D_USART0_RI0                       (_UINT32_(1) << 3)   /* USART0 signal: USART0_RI0 */

#define PIN_PB03C_USART0_RTS0                      _UINT32_(35)         /* USART0 signal: USART0_RTS0 on PB03 mux C */
#define MUX_PB03C_USART0_RTS0                      _UINT32_(2)          /* USART0 signal line function value: USART0_RTS0 */
#define PIO_PB03C_USART0_RTS0                      (_UINT32_(1) << 3)   /* USART0 signal: USART0_RTS0 */

#define PIN_PB00C_USART0_RXD0                      _UINT32_(32)         /* USART0 signal: USART0_RXD0 on PB00 mux C */
#define MUX_PB00C_USART0_RXD0                      _UINT32_(2)          /* USART0 signal line function value: USART0_RXD0 */
#define PIO_PB00C_USART0_RXD0                      (_UINT32_(1) << 0)   /* USART0 signal: USART0_RXD0 */

#define PIN_PB01C_USART0_TXD0                      _UINT32_(33)         /* USART0 signal: USART0_TXD0 on PB01 mux C */
#define MUX_PB01C_USART0_TXD0                      _UINT32_(2)          /* USART0 signal line function value: USART0_TXD0 */
#define PIO_PB01C_USART0_TXD0                      (_UINT32_(1) << 1)   /* USART0 signal: USART0_TXD0 */

/* ================== PIO definition for USART1 peripheral ================== */
#define PIN_PA27A_USART1_DTR1                      _UINT32_(27)         /* USART1 signal: USART1_DTR1 on PA27 mux A */
#define MUX_PA27A_USART1_DTR1                      _UINT32_(0)          /* USART1 signal line function value: USART1_DTR1 */
#define PIO_PA27A_USART1_DTR1                      (_UINT32_(1) << 27)  /* USART1 signal: USART1_DTR1 */

#define PIN_PA03B_USART1_LONCOL1                   _UINT32_(3)          /* USART1 signal: USART1_LONCOL1 on PA03 mux B */
#define MUX_PA03B_USART1_LONCOL1                   _UINT32_(1)          /* USART1 signal line function value: USART1_LONCOL1 */
#define PIO_PA03B_USART1_LONCOL1                   (_UINT32_(1) << 3)   /* USART1 signal: USART1_LONCOL1 */

#define PIN_PA24A_USART1_RTS1                      _UINT32_(24)         /* USART1 signal: USART1_RTS1 on PA24 mux A */
#define MUX_PA24A_USART1_RTS1                      _UINT32_(0)          /* USART1 signal line function value: USART1_RTS1 */
#define PIO_PA24A_USART1_RTS1                      (_UINT32_(1) << 24)  /* USART1 signal: USART1_RTS1 */

#define PIN_PA21A_USART1_RXD1                      _UINT32_(21)         /* USART1 signal: USART1_RXD1 on PA21 mux A */
#define MUX_PA21A_USART1_RXD1                      _UINT32_(0)          /* USART1 signal line function value: USART1_RXD1 */
#define PIO_PA21A_USART1_RXD1                      (_UINT32_(1) << 21)  /* USART1 signal: USART1_RXD1 */

#define PIN_PB04D_USART1_TXD1                      _UINT32_(36)         /* USART1 signal: USART1_TXD1 on PB04 mux D */
#define MUX_PB04D_USART1_TXD1                      _UINT32_(3)          /* USART1 signal line function value: USART1_TXD1 */
#define PIO_PB04D_USART1_TXD1                      (_UINT32_(1) << 4)   /* USART1 signal: USART1_TXD1 */

/* =================== PIO definition for ICE peripheral ==================== */
#define PIN_PB07X1_ICE_SWDCLK                      _UINT32_(39)         /* ICE signal: ICE_SWDCLK on PB07 mux X1 */
#define PIO_PB07X1_ICE_SWDCLK                      (_UINT32_(1) << 7)   /* ICE signal: ICE_SWDCLK */

#define PIN_PB06X1_ICE_SWDIO                       _UINT32_(38)         /* ICE signal: ICE_SWDIO on PB06 mux X1 */
#define PIO_PB06X1_ICE_SWDIO                       (_UINT32_(1) << 6)   /* ICE signal: ICE_SWDIO */

#define PIN_PB07X1_ICE_TCK                         _UINT32_(39)         /* ICE signal: ICE_TCK on PB07 mux X1 */
#define PIO_PB07X1_ICE_TCK                         (_UINT32_(1) << 7)   /* ICE signal: ICE_TCK */

#define PIN_PB04X1_ICE_TDI                         _UINT32_(36)         /* ICE signal: ICE_TDI on PB04 mux X1 */
#define PIO_PB04X1_ICE_TDI                         (_UINT32_(1) << 4)   /* ICE signal: ICE_TDI */

#define PIN_PB05X1_ICE_TDO                         _UINT32_(37)         /* ICE signal: ICE_TDO on PB05 mux X1 */
#define PIO_PB05X1_ICE_TDO                         (_UINT32_(1) << 5)   /* ICE signal: ICE_TDO */

#define PIN_PB06X1_ICE_TMS                         _UINT32_(38)         /* ICE signal: ICE_TMS on PB06 mux X1 */
#define PIO_PB06X1_ICE_TMS                         (_UINT32_(1) << 6)   /* ICE signal: ICE_TMS */

#define PIN_PB05X1_ICE_TRACESWO                    _UINT32_(37)         /* ICE signal: ICE_TRACESWO on PB05 mux X1 */
#define PIO_PB05X1_ICE_TRACESWO                    (_UINT32_(1) << 5)   /* ICE signal: ICE_TRACESWO */

/* =================== PIO definition for TPIU peripheral =================== */
#define PIN_PD08D_TPIU_TRACECLK                    _UINT32_(104)        /* TPIU signal: TPIU_TRACECLK on PD08 mux D */
#define MUX_PD08D_TPIU_TRACECLK                    _UINT32_(3)          /* TPIU signal line function value: TPIU_TRACECLK */
#define PIO_PD08D_TPIU_TRACECLK                    (_UINT32_(1) << 8)   /* TPIU signal: TPIU_TRACECLK */

#define PIN_PD04C_TPIU_TRACED0                     _UINT32_(100)        /* TPIU signal: TPIU_TRACED0 on PD04 mux C */
#define MUX_PD04C_TPIU_TRACED0                     _UINT32_(2)          /* TPIU signal line function value: TPIU_TRACED0 */
#define PIO_PD04C_TPIU_TRACED0                     (_UINT32_(1) << 4)   /* TPIU signal: TPIU_TRACED0 */

#define PIN_PD05C_TPIU_TRACED1                     _UINT32_(101)        /* TPIU signal: TPIU_TRACED1 on PD05 mux C */
#define MUX_PD05C_TPIU_TRACED1                     _UINT32_(2)          /* TPIU signal line function value: TPIU_TRACED1 */
#define PIO_PD05C_TPIU_TRACED1                     (_UINT32_(1) << 5)   /* TPIU signal: TPIU_TRACED1 */

#define PIN_PD06C_TPIU_TRACED2                     _UINT32_(102)        /* TPIU signal: TPIU_TRACED2 on PD06 mux C */
#define MUX_PD06C_TPIU_TRACED2                     _UINT32_(2)          /* TPIU signal line function value: TPIU_TRACED2 */
#define PIO_PD06C_TPIU_TRACED2                     (_UINT32_(1) << 6)   /* TPIU signal: TPIU_TRACED2 */

#define PIN_PD07C_TPIU_TRACED3                     _UINT32_(103)        /* TPIU signal: TPIU_TRACED3 on PD07 mux C */
#define MUX_PD07C_TPIU_TRACED3                     _UINT32_(2)          /* TPIU signal line function value: TPIU_TRACED3 */
#define PIO_PD07C_TPIU_TRACED3                     (_UINT32_(1) << 7)   /* TPIU signal: TPIU_TRACED3 */



#endif /* _pic32cz2051ca70064_GPIO_H_ */

